## Pandas - DataFrame And Series

Pandas is a powerful data manipulation library in python, widely used for data analysis and data cleaning. it prvides two primary data structures: Series and DataFrame, A Series is a one-dimensional array-like object, while a DataFrame is a two  dimensional , sia=ze-mutable, and potentially heterogenious tabular data structure with labeled axes(row and columns)

In [5]:
pip install pandas

^C
Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: pandas in c:\users\kk707\onedrive\desktop\data-science\venv\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\kk707\onedrive\desktop\data-science\venv\lib\site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\kk707\onedrive\desktop\data-science\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\kk707\onedrive\desktop\data-science\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\kk707\onedrive\desktop\data-science\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\kk707\onedrive\desktop\data-science\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [ ]:
## Series 
## A pandas series is a one-dimensional array-like object that can hold any data type . it is similar to a column in a table.

import pandas as pd
data = [1,2,3,4,5]
series = pd.Series(data)
print("Series \n", series)

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [ ]:
# Create a series from dictionary
data = {'a':1,'b':2,'c':3}
series = pd.Series(data)
print(series)

a    1
b    2
c    3
dtype: int64

In [ ]:
## Create 
data = [10,20,30]
index = ['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [ ]:
## DataFrames
data = {
    'name' : ["Kanhaiya","krishnamohan","Nandan"],
    'age':[20,13,32],
    'City':["New york","London","lords"]
}
df =  pd.DataFrame(data)
print(df)
print(type(df))

           name  age      City
0      Kanhaiya   20  New york
1  krishnamohan   13    London
2        Nandan   32     lords
<class 'pandas.core.frame.DataFrame'>

In [ ]:
data = [
    {"name":"kanhaiya","age":21,"City":"Begusarai"},
    {"name":"Ankit","age":22,"City":"Patna"},
    {"name":"Anurag","age":19,"City":"Begusarai"},
    {"name":"John","age":23,"City":"Betican"},
]
df = pd.DataFrame(data)
print(df)

       name  age       City
0  kanhaiya   21  Begusarai
1     Ankit   22      Patna
2    Anurag   19  Begusarai
3      John   23    Betican

In [ ]:
## Reading data from a csv file

df = pd.read_csv('data.csv')   # sales_data.csv is FileName
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [ ]:
## df.tale(5)

In [ ]:
df

       name  age       City
0  kanhaiya   21  Begusarai
1     Ankit   22      Patna
2    Anurag   19  Begusarai
3      John   23    Betican

In [ ]:
df.name

0    kanhaiya
1       Ankit
2      Anurag
3        John
Name: name, dtype: object

In [ ]:
df.loc[0]

name     kanhaiya
age            21
City    Begusarai
Name: 0, dtype: object

In [ ]:
df.iloc[0]

name     kanhaiya
age            21
City    Begusarai
Name: 0, dtype: object

In [ ]:
df.iloc[0][0]

C:\Users\kk707\AppData\Local\Temp\ipykernel_14460\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'kanhaiya'

In [ ]:
## Accessing an specified element

df["name"]

0    kanhaiya
1       Ankit
2      Anurag
3        John
Name: name, dtype: object

In [ ]:
## Accessing an specified element

df

       name  age       City
0  kanhaiya   21  Begusarai
1     Ankit   22      Patna
2    Anurag   19  Begusarai
3      John   23    Betican

In [ ]:
## Accessing an specified element

df.at[2,"name"]

'Anurag'

In [ ]:
df.at[2,"City"]

'Begusarai'

In [ ]:
df.iat[2,2]

'Begusarai'

In [ ]:
### Data MAnipulation with DataFrames
df

       name  age       City
0  kanhaiya   21  Begusarai
1     Ankit   22      Patna
2    Anurag   19  Begusarai
3      John   23    Betican

In [ ]:
df['Salary'] = [150000,60000,70000,80000]
df

       name  age       City  Salary
0  kanhaiya   21  Begusarai  150000
1     Ankit   22      Patna   60000
2    Anurag   19  Begusarai   70000
3      John   23    Betican   80000

In [ ]:
df.drop("age",axis=1,inplace=True)

In [ ]:
df

       name       City  Salary
0  kanhaiya  Begusarai  150000
1     Ankit      Patna   60000
2    Anurag  Begusarai   70000
3      John    Betican   80000

In [ ]:
## Add age to the column

df['Salary']=df['Salary']+100000

In [ ]:
df

       name       City  Salary
0  kanhaiya  Begusarai  250000
1     Ankit      Patna  160000
2    Anurag  Begusarai  170000
3      John    Betican  180000

In [ ]:
df.drop(1)

       name       City  Salary
0  kanhaiya  Begusarai  250000
2    Anurag  Begusarai  170000
3      John    Betican  180000

In [ ]:
df

       name       City  Salary
0  kanhaiya  Begusarai  250000
1     Ankit      Patna  160000
2    Anurag  Begusarai  170000
3      John    Betican  180000

In [ ]:
df.drop(3,inplace=True)

In [ ]:
df

       name       City  Salary
0  kanhaiya  Begusarai  250000
1     Ankit      Patna  160000
2    Anurag  Begusarai  170000

In [ ]:
## Display the data type of each column
print("Data types:\n",df.dtypes)

## Describe the Dataframe
print("Statistical summery :\n",df.describe())

Data types:
 name      object
City      object
Salary     int64
dtype: object
Statistical summery :
               Salary
count       3.000000
mean   193333.333333
std     49328.828623
min    160000.000000
25%    165000.000000
50%    170000.000000
75%    210000.000000
max    250000.000000

In [ ]:
df.describe()

              Salary
count       3.000000
mean   193333.333333
std     49328.828623
min    160000.000000
25%    165000.000000
50%    170000.000000
75%    210000.000000
max    250000.000000